package api;

// TODO: 18.01.2022 Здесь нужна фикстура
//  Для конкретно этого эндпоинта требуется EmployeesID и ProjectsID
//  Поле date_from - является обязательным для заполнения
//  Лиду не присваивается айдишник, из-за этого отсутствует
//  возможность удаления созданной сущности
//  То же самое касается и патча, невозможно ничего заменить
//  Есть возможность найти по айдишнику, но при этом он нигде
//  не отображается и непонятно к чему обращаться
//  Вероятноо всего просто забыли вытащить из базы айдишник
public class ProjectLeadsTest {
}
